src/main/java/ru/vk/itmo/test/timofeevkirill/results/task2/wrk2/put/h_950_000rps_24threads_12288linked_64connections
./wrk -d 2m -t 8 -c 64 -R 950000 -s /home/aphirri/IdeaProjects/2024-highload-dht/src/main/java/ru/vk/itmo/test/timofeevkirill/scripts/lua/put.lua -L http://localhost:8080/v0/entry
Running 2m test @ http://localhost:8080/v0/entry
  8 threads and 64 connections
  Thread calibration: mean lat.: 70.435ms, rate sampling interval: 388ms
  Thread calibration: mean lat.: 91.209ms, rate sampling interval: 422ms
  Thread calibration: mean lat.: 63.972ms, rate sampling interval: 334ms
  Thread calibration: mean lat.: 66.950ms, rate sampling interval: 362ms
  Thread calibration: mean lat.: 46.269ms, rate sampling interval: 280ms
  Thread calibration: mean lat.: 45.256ms, rate sampling interval: 233ms
  Thread calibration: mean lat.: 59.426ms, rate sampling interval: 329ms
  Thread calibration: mean lat.: 91.310ms, rate sampling interval: 429ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.23ms    9.92ms 140.93ms   90.32%
    Req/Sec   118.94k     4.34k  151.27k    83.79%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.34ms
 75.000%    4.97ms
 90.000%   14.76ms
 99.000%   49.41ms
 99.900%   87.61ms
 99.990%  126.85ms
 99.999%  136.57ms
100.000%  141.05ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.008     0.000000            1         1.00
       0.319     0.100000     10484744         1.11
       0.584     0.200000     20933599         1.25
       0.834     0.300000     31352064         1.43
       1.074     0.400000     41830467         1.67
       1.344     0.500000     52236044         2.00
       1.538     0.550000     57465321         2.22
       1.851     0.600000     62683831         2.50
       2.475     0.650000     67914649         2.86
       3.505     0.700000     73134305         3.33
       4.975     0.750000     78359405         4.00
       5.907     0.775000     80964894         4.44
       7.011     0.800000     83580325         5.00
       8.343     0.825000     86193637         5.71
       9.983     0.850000     88806473         6.67
      12.055     0.875000     91417572         8.00
      13.311     0.887500     92721371         8.89
      14.759     0.900000     94027884        10.00
      16.447     0.912500     95332246        11.43
      18.479     0.925000     96638243        13.33
      21.023     0.937500     97945560        16.00
      22.527     0.943750     98593419        17.78
      24.255     0.950000     99245095        20.00
      26.271     0.956250     99899005        22.86
      28.655     0.962500    100550566        26.67
      31.471     0.968750    101206015        32.00
      33.087     0.971875    101533256        35.56
      34.911     0.975000    101860549        40.00
      36.959     0.978125    102183448        45.71
      39.359     0.981250    102510383        53.33
      42.271     0.984375    102838661        64.00
      43.967     0.985938    103001054        71.11
      45.823     0.987500    103162981        80.00
      47.967     0.989062    103326406        91.43
      50.463     0.990625    103489279       106.67
      53.407     0.992188    103652250       128.00
      55.039     0.992969    103733774       142.22
      56.959     0.993750    103816333       160.00
      59.103     0.994531    103897835       182.86
      61.695     0.995313    103978522       213.33
      64.799     0.996094    104060581       256.00
      66.687     0.996484    104102245       284.44
      68.863     0.996875    104142148       320.00
      71.167     0.997266    104182620       365.71
      73.791     0.997656    104223842       426.67
      76.927     0.998047    104264509       512.00
      78.591     0.998242    104284864       568.89
      80.255     0.998437    104304938       640.00
      82.559     0.998633    104325504       731.43
      85.183     0.998828    104345941       853.33
      87.999     0.999023    104366198      1024.00
      89.727     0.999121    104376403      1137.78
      91.647     0.999219    104386781      1280.00
      93.503     0.999316    104396761      1462.86
      96.127     0.999414    104407122      1706.67
      99.583     0.999512    104417183      2048.00
     102.719     0.999561    104422214      2275.56
     105.727     0.999609    104427369      2560.00
     108.863     0.999658    104432482      2925.71
     112.255     0.999707    104437586      3413.33
     115.647     0.999756    104442660      4096.00
     117.247     0.999780    104445175      4551.11
     119.103     0.999805    104447721      5120.00
     120.895     0.999829    104450299      5851.43
     122.879     0.999854    104452822      6826.67
     125.055     0.999878    104455426      8192.00
     126.015     0.999890    104456627      9102.22
     127.039     0.999902    104457979     10240.00
     127.999     0.999915    104459179     11702.86
     129.023     0.999927    104460536     13653.33
     129.983     0.999939    104461774     16384.00
     130.623     0.999945    104462369     18204.44
     131.327     0.999951    104463011     20480.00
     132.223     0.999957    104463691     23405.71
     132.735     0.999963    104464373     27306.67
     133.247     0.999969    104464964     32768.00
     133.631     0.999973    104465332     36408.89
     133.887     0.999976    104465553     40960.00
     134.271     0.999979    104465873     46811.43
     134.783     0.999982    104466196     54613.33
     135.551     0.999985    104466596     65536.00
     135.807     0.999986    104466701     72817.78
     136.063     0.999988    104466829     81920.00
     136.575     0.999989    104467072     93622.86
     136.831     0.999991    104467175    109226.67
     137.343     0.999992    104467313    131072.00
     137.855     0.999993    104467418    145635.56
     138.239     0.999994    104467486    163840.00
     138.623     0.999995    104467558    187245.71
     139.007     0.999995    104467695    218453.33
     139.135     0.999996    104467732    262144.00
     139.263     0.999997    104467764    291271.11
     139.391     0.999997    104467810    327680.00
     139.519     0.999997    104467839    374491.43
     139.647     0.999998    104467883    436906.67
     139.903     0.999998    104467957    524288.00
     139.903     0.999998    104467957    582542.22
     139.903     0.999998    104467957    655360.00
     140.031     0.999999    104467975    748982.86
     140.159     0.999999    104468004    873813.33
     140.159     0.999999    104468004   1048576.00
     140.287     0.999999    104468026   1165084.44
     140.287     0.999999    104468026   1310720.00
     140.415     0.999999    104468035   1497965.71
     140.543     0.999999    104468045   1747626.67
     140.671     1.000000    104468064   2097152.00
     140.671     1.000000    104468064   2330168.89
     140.671     1.000000    104468064   2621440.00
     140.799     1.000000    104468078   2995931.43
     140.799     1.000000    104468078   3495253.33
     140.927     1.000000    104468088   4194304.00
     140.927     1.000000    104468088   4660337.78
     140.927     1.000000    104468088   5242880.00
     140.927     1.000000    104468088   5991862.86
     141.055     1.000000    104468103   6990506.67
     141.055     1.000000    104468103          inf
#[Mean    =        5.232, StdDeviation   =        9.921]
#[Max     =      140.928, Total count    =    104468103]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  113980351 requests in 2.00m, 7.11GB read
Requests/sec: 949850.18
Transfer/sec:     60.69MB